Autodesk.Revit.DB.ExternalResourceReferenceUpdatedDataForWorksharing.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.ExternalResourceReferenceUpdatedDataForWorksharing.#ctor(Autodesk.Revit.DB.FailureDefinitionId)
Constructor data from failure id.
failureId:
The failure id.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2018

Autodesk.Revit.DB.ExternalResourceReferenceUpdatedDataForWorksharing.#ctor(Autodesk.Revit.DB.ExternalResourceReference)
Constructor data from updated resource.
updatedReference:
The updated resource.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2018

Autodesk.Revit.DB.ExternalResourceReferenceUpdatedDataForWorksharing
The data to be returned by IExternalResourceServerInternal::getUpdatedResourceDataForWorksharing()
If a valid failureId is returned then that failure is posted so a user can delete the element.
If not, the ExternalResourceReference is copied to the Element. The resource must be well formed and the interface
IExternalResourceServerInternal::resourceNeedsUpdateForWorksharing() should return true for that
resource.
Since:
2018